
from Nepali_summarizer.summarizer import Nepali_summarizer

text = ["नेपाल एक अद्भुत देश हो।",
        "यो हिमालयको छायामा बस्ने जग्गा हो जसले प्राकृतिक सौन्दर्यलाई चिनारी दिन्छ।",
        "पहाडी तराई र हिमालयको मेलमिलापले यसलाई विशेष बनाउँछ।",
        "प्रकृतिक सौन्दर्य, विविधता, र ऐतिहासिक समृद्धिले नेपाललाई विश्वभरी प्रसिद्ध बनाएको छ।",
        "यो देश भिन्न जाति, भाषा, र संस्कृतिको संग्रहणभरिको छनौटमा बिराजमान छ।",
        "यहाँका मानवतावादी भावनाहरू विश्वसामान्य रूपमा स्वागत गरिन्छ।",
        "समृद्धि, सहजता, र सामाजिक न्यायलाई अपेक्षा गर्दै नेपाली लोकसेवा गर्दछन्।"]

## Import the class for summarization       
summarizer = Nepali_summarizer()

##get summary
summary = summarizer.generate_summary(text)

##Output
## नेपाल एक अद्भुत देश हो। पहाडी तराई र हिमालयको मेलमिलापले यसलाई विशेष बनाउँछ। यहाँका मानवतावादी भावनाहरू विश्वसामान्य रूपमा स्वागत गरिन्छ।
